torbrodtkorb/alva-master/firmware/pack/edc/AVR16DD32.PIC
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CTRLC" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x602">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="PRESC" edc:nzwidth="0x4" edc:desc="Clock Pre-scaler">
                <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_PER divided by 2" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_PER divided by 4" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_PER divided by 8" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DIV12" edc:desc="CLK_PER divided by 12" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_PER divided by 16" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="DIV20" edc:desc="CLK_PER divided by 20" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="DIV24" edc:desc="CLK_PER divided by 24" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="DIV28" edc:desc="CLK_PER divided by 28" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_PER divided by 32" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="DIV48" edc:desc="CLK_PER divided by 48" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_PER divided by 64" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="DIV96" edc:desc="CLK_PER divided by 96" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_PER divided by 128" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_PER divided by 256" edc:when="(field &amp; 0xF) == 0x0D"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CTRLD" edc:nzwidth="0x8" edc:access="nnn-nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xEF" edc:_addr="0x603">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="SAMPDLY" edc:nzwidth="0x4" edc:desc="Sampling Delay Selection">
                <edc:SFRFieldSemantic edc:cname="DLY0" edc:desc="Delay 0 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DLY1" edc:desc="Delay 1 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DLY2" edc:desc="Delay 2 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DLY3" edc:desc="Delay 3 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DLY4" edc:desc="Delay 4 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="DLY5" edc:desc="Delay 5 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="DLY6" edc:desc="Delay 6 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="DLY7" edc:desc="Delay 7 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="DLY8" edc:desc="Delay 8 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="DLY9" edc:desc="Delay 9 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="DLY10" edc:desc="Delay 10 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="DLY11" edc:desc="Delay 11 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="DLY12" edc:desc="Delay 12 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="DLY13" edc:desc="Delay 13 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="DLY14" edc:desc="Delay 14 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="DLY15" edc:desc="Delay 15 CLK_ADC cycles" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="INITDLY" edc:nzwidth="0x3" edc:desc="Initial Delay Selection">
                <edc:SFRFieldSemantic edc:cname="DLY0" edc:desc="Delay 0 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DLY16" edc:desc="Delay 16 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DLY32" edc:desc="Delay 32 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DLY64" edc:desc="Delay 64 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DLY128" edc:desc="Delay 128 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="DLY256" edc:desc="Delay 256 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x05"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CTRLE" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x604">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="WINCM" edc:nzwidth="0x3" edc:desc="Window Comparator Mode">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Window Comparison" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Below Window" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Above Window" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="INSIDE" edc:desc="Inside Window" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="OUTSIDE" edc:desc="Outside Window" edc:when="(field &amp; 0x7) == 0x04"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="SAMPCTRL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x605">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="SAMPLEN" edc:nzwidth="0x8" edc:desc="Sample lenght"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x606"/>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="MUXPOS" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0x608">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x7" edc:desc="Analog Channel Selection Bits">
                <edc:SFRFieldSemantic edc:cname="AIN1" edc:desc="ADC input pin 1" edc:when="(field &amp; 0x7F) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="AIN2" edc:desc="ADC input pin 2" edc:when="(field &amp; 0x7F) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="AIN3" edc:desc="ADC input pin 3" edc:when="(field &amp; 0x7F) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="AIN4" edc:desc="ADC input pin 4" edc:when="(field &amp; 0x7F) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="AIN5" edc:desc="ADC input pin 5" edc:when="(field &amp; 0x7F) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="AIN6" edc:desc="ADC input pin 6" edc:when="(field &amp; 0x7F) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="AIN7" edc:desc="ADC input pin 7" edc:when="(field &amp; 0x7F) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="AIN16" edc:desc="ADC input pin 16" edc:when="(field &amp; 0x7F) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="AIN17" edc:desc="ADC input pin 17" edc:when="(field &amp; 0x7F) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="AIN18" edc:desc="ADC input pin 18" edc:when="(field &amp; 0x7F) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="AIN19" edc:desc="ADC input pin 19" edc:when="(field &amp; 0x7F) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="AIN20" edc:desc="ADC input pin 20" edc:when="(field &amp; 0x7F) == 0x14"/>
                <edc:SFRFieldSemantic edc:cname="AIN21" edc:desc="ADC input pin 21" edc:when="(field &amp; 0x7F) == 0x15"/>
                <edc:SFRFieldSemantic edc:cname="AIN22" edc:desc="ADC input pin 22" edc:when="(field &amp; 0x7F) == 0x16"/>
                <edc:SFRFieldSemantic edc:cname="AIN23" edc:desc="ADC input pin 23" edc:when="(field &amp; 0x7F) == 0x17"/>
                <edc:SFRFieldSemantic edc:cname="AIN24" edc:desc="ADC input pin 24" edc:when="(field &amp; 0x7F) == 0x18"/>
                <edc:SFRFieldSemantic edc:cname="AIN25" edc:desc="ADC input pin 25" edc:when="(field &amp; 0x7F) == 0x19"/>
                <edc:SFRFieldSemantic edc:cname="AIN26" edc:desc="ADC input pin 26" edc:when="(field &amp; 0x7F) == 0x1A"/>
                <edc:SFRFieldSemantic edc:cname="AIN27" edc:desc="ADC input pin 27" edc:when="(field &amp; 0x7F) == 0x1B"/>
                <edc:SFRFieldSemantic edc:cname="AIN28" edc:desc="ADC input pin 28" edc:when="(field &amp; 0x7F) == 0x1C"/>
                <edc:SFRFieldSemantic edc:cname="AIN29" edc:desc="ADC input pin 29" edc:when="(field &amp; 0x7F) == 0x1D"/>
                <edc:SFRFieldSemantic edc:cname="AIN30" edc:desc="ADC input pin 30" edc:when="(field &amp; 0x7F) == 0x1E"/>
                <edc:SFRFieldSemantic edc:cname="AIN31" edc:desc="ADC input pin 31" edc:when="(field &amp; 0x7F) == 0x1F"/>
                <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0x7F) == 0x40"/>
                <edc:SFRFieldSemantic edc:cname="TEMPSENSE" edc:desc="Temperature sensor" edc:when="(field &amp; 0x7F) == 0x42"/>
                <edc:SFRFieldSemantic edc:cname="VDDDIV10" edc:desc="VDD/10" edc:when="(field &amp; 0x7F) == 0x44"/>
                <edc:SFRFieldSemantic edc:cname="VDDIO2DIV10" edc:desc="VDDIO2/10" edc:when="(field &amp; 0x7F) == 0x45"/>
                <edc:SFRFieldSemantic edc:cname="DAC0" edc:desc="DAC0" edc:when="(field &amp; 0x7F) == 0x48"/>
                <edc:SFRFieldSemantic edc:cname="DACREF0" edc:desc="DACREF0" edc:when="(field &amp; 0x7F) == 0x49"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
